#!/bin/sh

seq 1 999999 \
| # 100万未満の数列の生成
sed -e 's/./& /g' \
| # awkで扱うためにFS(スペース)の挿入
awk 'NF%2 != 0 {for(i=1; i<=(NF-1)/2; i++){if($i != $(NF-i+1)){next}}; print} NF%2 == 0 {for(i=1; i<=NF/2; i++){if($i != $(NF-i+1)){next}}; print}' \
| # 回文の抽出(10進数)
tr -d ' ' \
| # FS(スペース)の除去
sed -e 's/.*/obase=2; ibase=10; &;/' \
| # 10進数->2進数変換式の生成
bc \
| # 10進数->2進数変換の実行
sed -e 's/./& /g' \
| # awkで扱うためにFS(スペース)の挿入
awk 'NF%2 != 0 {for(i=1; i<=(NF-1)/2; i++){if($i != $(NF-i+1)){next}}; print} NF%2 == 0 {for(i=1; i<=NF/2; i++){if($i != $(NF-i+1)){next}}; print}' \
| # 回文の抽出(2進数)
tr -d ' ' \
| # FS(スペース)の除去
sed -e 's/.*/ibase=2; &;/' \
| # 2進数->10進数変換式の生成
bc \
| # 2進数->10進数変換の実行
tr '\n' '+' \
| # 総和算出式の生成
sed -e 's/+$/\n/' \
| # 末尾の余分な演算子'+'の除去
bc
  # 総和の出力
